HELYXcore-4.4.0/examples/legacy/lagrangian/MPPICFoam/cyclone/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (-0.55 -0.55 -1  )
    ( 0.55 -0.55 -1  )
    ( 0.55  0.55 -1  )
    (-0.55  0.55 -1  )

    (-0.55 -0.55  1.1)
    ( 0.55 -0.55  1.1)
    ( 0.55  0.55  1.1)
    (-0.55  0.55  1.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 33 63) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
