HELYXcore-4.4.0/examples/legacy/lagrangian/MPPICFoam/cyclone/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type fixedFluxPressure;
        value $internalField;
    }

    outlet
    {
        type fixedValue;
        value uniform 0;
    }

    walls
    {
        type fixedFluxPressure;
        value $internalField;
    }
}


// ************************************************************************* //
